docs/writing-proposals.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-04-30 Sun 15:03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Writing Proposals</title>
<meta name="author" content="Alexander Brown" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="preamble" class="status">
<nav><a href="index.html">Home</a> | <a href="blog.html">Blog</a> | <a href="notes.html">Notes</a> | <a href="class.html">Classes</a> | <a href="projects.html">Projects</a> | <a href="todo.html">Todo</a> | <a href="error.html">About</a></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Writing Proposals</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0737c60">1. Purpose of a Proposal</a></li>
<li><a href="#org965d053">2. Style of Proposal</a></li>
<li><a href="#org6243fe0">3. Preparing to Write</a></li>
<li><a href="#orgf82044d">4. Proposals</a>
<ul>
<li><a href="#org22e6aef">4.1. Cover Page/Title Page</a></li>
<li><a href="#orgb22bc4d">4.2. Project Overview/Executive Summary/Abstract:</a></li>
<li><a href="#orgc3a7af0">4.3. Narrative</a>
<ul>
<li><a href="#orgc2e21c3">4.3.1. Introduction/Background/Need and Fit</a></li>
<li><a href="#orgcfa886f">4.3.2. Method</a></li>
<li><a href="#org74e7b57">4.3.3. Project Timeline</a></li>
</ul>
</li>
<li><a href="#orgd176128">4.4. List of References/Bibliography</a></li>
</ul>
</li>
<li><a href="#org6e87308">5. Short Proposal Format</a></li>
<li><a href="#org52b6e09">6. Bibliography</a></li>
</ul>
</div>
</nav>
<p>
Both proposals and request for proposals can be used to initiate a project. An RFP is usually issued by an organization
to solve a problem. The proposal itself initiates a particular solution for the project. A proposal is typically written
against an RFP to acquire funding to solve the problem that particular project by the means written in your proposal. No
RFP will be looking precisely for the idea you have formulated, so it is up to the writer to like the idea with the RFP
<a href="&amp;Knisely_Charles_W_2014-01-01">&amp;Knisely_Charles_W_2014-01-01</a>. Thesis and dissertations typically fall in the range of "short proposals", as they
typically range from 2 to 10 pages.
</p>

<div id="outline-container-org0737c60" class="outline-2">
<h2 id="org0737c60"><span class="section-number-2">1.</span> Purpose of a Proposal</h2>
<div class="outline-text-2" id="text-1">
<p>
Any proposal has three main components <a href="&amp;Knisely_Charles_W_2014-01-01">&amp;Knisely_Charles_W_2014-01-01</a>:
</p>

<ul class="org-ul">
<li>The work is significant, consistent with the state-of-the-art, fills clear needs</li>
<li>The person working the project is the right person</li>
<li>The project is feasible</li>
</ul>

<blockquote>
<p>
A winning proposal not only gives the reader the confidence that the writers have thoroughly understood both the need
that the project is addressing and possible solutions other than their own; it also conveys a clear sense that the
writers are capable of successfully completing the project—that they are able to budget time and resources
appropriately <a href="&amp;Irish_Robert2013-04-01">&amp;Irish_Robert2013-04-01</a>.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org965d053" class="outline-2">
<h2 id="org965d053"><span class="section-number-2">2.</span> Style of Proposal</h2>
<div class="outline-text-2" id="text-2">
<p>
All proposals contain similar contents <a href="&amp;Knisely_Charles_W_2014-01-01">&amp;Knisely_Charles_W_2014-01-01</a>:
</p>

<ul class="org-ul">
<li>Purpose is concisely stated at the beginning</li>
<li>Relevant background information is summarized</li>
<li>The language is understandable</li>
<li>The sentences are short to moderate to enhance readability</li>
<li>The proposed ideas are stated clearly</li>
<li>All the information provided convinces the reader that the project is worth funding (or accepting)</li>
</ul>
</div>
</div>

<div id="outline-container-org6243fe0" class="outline-2">
<h2 id="org6243fe0"><span class="section-number-2">3.</span> Preparing to Write</h2>
<div class="outline-text-2" id="text-3">
<p>
Once you know what is desired to be proposed:
</p>

<ul class="org-ul">
<li>State the purpose clearly</li>
<li>State explicitly the need of the proposal</li>
<li>Ensure that the work is consistent with the philosophy of those who will fund/approve</li>
<li>Ensure that the proposed work meets the desired need</li>
</ul>

<p>
Now that the problem has been identified, and a solution provided, <b>how will the project be done</b>? The outline should
address <a href="&amp;Knisely_Charles_W_2014-01-01">&amp;Knisely_Charles_W_2014-01-01</a>:
</p>

<ul class="org-ul">
<li>Method(s) and approach(es)</li>
<li>Timeline</li>
<li>Resources</li>
<li>Projected outcome</li>
<li>Assessment plan (how you will measure the project's success)</li>
</ul>

<p>
This "how" section is helpful to be represented as a table or Gantt chart.
</p>
</div>
</div>

<div id="outline-container-orgf82044d" class="outline-2">
<h2 id="orgf82044d"><span class="section-number-2">4.</span> Proposals</h2>
<div class="outline-text-2" id="text-4">
<p>
Many proposals will have a specified format which ought to be followed. In the absence of guidelines, the following
structure may be suitable <a href="&amp;Knisely_Charles_W_2014-01-01;&amp;Irish_Robert2013-04-01">&amp;Knisely_Charles_W_2014-01-01;&amp;Irish_Robert2013-04-01</a>:
</p>

<ul class="org-ul">
<li>Cover Page</li>
<li>Executive Summary
<ul class="org-ul">
<li>Hypothesis or Purpose</li>
<li>Motivation and Scope</li>
<li>Objectives</li>
</ul></li>
<li>The Narrative
<ul class="org-ul">
<li>State-Of-The-Art</li>
<li>Methodology</li>
<li>Procedure</li>
</ul></li>
<li>The Budget (N/A for my case so I skip)</li>
<li>References or Bibliography</li>
<li>Supporting Documentation</li>
</ul>
</div>

<div id="outline-container-org22e6aef" class="outline-3">
<h3 id="org22e6aef"><span class="section-number-3">4.1.</span> Cover Page/Title Page</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Title of project</li>
<li>Submitted to</li>
<li>Date</li>
<li>Name of principle investigators</li>
<li>Institutions to which the PI(s) belong</li>
</ul>
</div>
</div>

<div id="outline-container-orgb22bc4d" class="outline-3">
<h3 id="orgb22bc4d"><span class="section-number-3">4.2.</span> Project Overview/Executive Summary/Abstract:</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The project overview/executive summary/abstract should be written last. It should be able to answer the following
<a href="&amp;Knisely_Charles_W_2014-01-01">&amp;Knisely_Charles_W_2014-01-01</a>:
</p>

<ul class="org-ul">
<li>What do you want to do?</li>
<li>How will it be done?</li>
<li>Who is going to do it?</li>
<li>How will it fill the role of the RFP/problem statement</li>
<li>What are the anticipated outcomes?</li>
</ul>

<p>
The reader will understand the originality, rationale, the expected outcomes of the proposed work, the scale of the
project, the need for the work, and the significance of the outcome. If these are not portrayed clearly, then it must be
revisited.
</p>
</div>
</div>

<div id="outline-container-orgc3a7af0" class="outline-3">
<h3 id="orgc3a7af0"><span class="section-number-3">4.3.</span> Narrative</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This is the body of the text. It is typically subdivided into a few sections.
</p>
</div>

<div id="outline-container-orgc2e21c3" class="outline-4">
<h4 id="orgc2e21c3"><span class="section-number-4">4.3.1.</span> Introduction/Background/Need and Fit</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
This section is where a strong case is made for what the work is, how it fits with the state-of-the-art, why it is
significant, and how it aligns with the RFP/problem statement. The section should include
</p>

<ul class="org-ul">
<li>State-Of-The-Art: what is known and what is lacking</li>
<li>Background providing perspective for the reader</li>
<li>Statement of need in the context of existing information</li>
<li>Fits with the RFP/problem statement</li>
<li>Purpose, goals, and measurable objectives</li>
<li>Compelling and logical reasons for support</li>
</ul>
</div>
</div>

<div id="outline-container-orgcfa886f" class="outline-4">
<h4 id="orgcfa886f"><span class="section-number-4">4.3.2.</span> Method</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
How will the project be accomplished, and why was that method chosen?
</p>

<ul class="org-ul">
<li>Experimental</li>
<li>Analytical</li>
<li>Computational</li>
<li>Combined</li>
</ul>

<p>
Describe the methods and processes. Why is the method appropriate? How will the work be validated? What are the
outcomes?
</p>
</div>
</div>

<div id="outline-container-org74e7b57" class="outline-4">
<h4 id="org74e7b57"><span class="section-number-4">4.3.3.</span> Project Timeline</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>
This includes mileposts for completing different stages of the project. The timeline will include
</p>

<ul class="org-ul">
<li>Shows project flow</li>
<li>Start and end dates</li>
<li>Lists a schedule of activities, including project reports</li>
<li>Describes projected outcomes</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd176128" class="outline-3">
<h3 id="orgd176128"><span class="section-number-3">4.4.</span> List of References/Bibliography</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Cite, cite, cite.
</p>
</div>
</div>
</div>

<div id="outline-container-org6e87308" class="outline-2">
<h2 id="org6e87308"><span class="section-number-2">5.</span> Short Proposal Format</h2>
<div class="outline-text-2" id="text-5">
<p>
In academia, candidates for graduate degrees typically write formal proposals for their thesis or dissertation projects
before officially beginning work on the projects. M.S. thesis proposals are typically 5 to 10 pages. For PhD
dissertations proposals typically range from 10 to 15 pages; however, it is commonly seen that they range from 15 to 25
pages. A typical outline of a thesis/dissertation is outlined as follows <a href="&amp;Knisely_Charles_W_2014-01-01">&amp;Knisely_Charles_W_2014-01-01</a>:
</p>

<ul class="org-ul">
<li>Title Page: Proposed research topic, name, date, department, thesis advisor</li>
<li>Introduction - Problem to be addressed
<ul class="org-ul">
<li>Purpose of proposed work</li>
<li>Background and literature review, including theoretical analysis (if applicable)</li>
<li>Significance and scope of work</li>
</ul></li>
<li>Methods for solving the problem
<ul class="org-ul">
<li>Plan for accomplishing objectives</li>
<li>Justification for instrumentation, and data acquisition and processing</li>
<li>Plan for evaluating results</li>
<li>Timetable for project completion</li>
</ul></li>
<li>Resources
<ul class="org-ul">
<li>What is needed to solve the problem</li>
</ul></li>
<li>References</li>
</ul>
</div>
</div>

<div id="outline-container-org52b6e09" class="outline-2">
<h2 id="org52b6e09"><span class="section-number-2">6.</span> Bibliography</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="../main.bib">../main.bib</a>

</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alexander Brown</p>
<p class="date">Created: 2023-04-30 Sun 15:03</p>
</div>
</body>
</html>
